#Вариант 19. Дано вещественное число X и целое число N (> 0).Найти значение выражения X
#X^3/(3!)+X^5/(5!)-...+(-1)^N-X^2-N+1/((2+N+1)!) (N=12...N)
# Полученное число является приближенным значением функции sin в точке X.
x=input("Введите число x: ")
while type(x) != float:
    try:
        x = float(x)
    except ValueError:
        print("Неправильно ввели!")
        x = input("Введите число x: ")

n=input("Введите число N>0: ")
while type(n) != int:
    try:
        n = int(n)
    except ValueError:
        print("Неправильно ввели!")
        n = input("Введите число N>0: ")
a = x
b = x
i = 1
while i<= n:
    b = b* (-x ** 2) / ((2 * i) * (2 * i + 1))
    a += b
    i += 1
print("Приближенное значение sin(",x,") равно: ",a)


