#Вариант 19.Даны две переменные целого типа: A и B. Если их значения не равны, то присвоить
#каждой переменной сумму этих значений, а если равны, то присвоить переменным
#нулевые значения. Вывести новые значения переменных A и B.
while True:
  try:
    a = int(input("Введите первое число: "))
    b = int(input("Введите второе число: "))
    break
  except ValueError:
      print("Введие челое число!!!")
      continue
#Проверка значений
if a==b:
    a,b = 0, 0
    print (a,b)
else:
    a, b = a+(b+a), b+(a+b)
    print(a,b)